sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getRelatedNotes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getrelatednotes">
   <soapenv:Header/>
   <soapenv:Body>
      <sug:session>kdkpt57vp21bba7ff9ctuspni5</sug:session>
      <sug:moduleName>all</sug:moduleName>
      <sug:moduleId>2</sug:moduleId>
      <sug:selectFields></sug:selectFields>
   </soapenv:Body>
</soapenv:Envelope>